// 11. Dictators.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
#include <cstdlib>
#include <Windows.h>
#include <string>
using namespace std;

void yn()                                           //Упрощаем написание да/нет через создание ф-ции
{
    cout << "1. Да" << endl;
    cout << "2. Нет" << endl;
}
void clear()                                        //создаеем функцию которая всегда будет очищать экран
{
    system("cls");
}
void pause()
{
    system("pause");
}

int main()
{
    setlocale(LC_ALL, "ru");
    srand(time(0));

    string name;
    int choose;                                     //Отвечает за выбор участника
    int random;                                     //Переменная отвечающая за рандомизацию событий
    int randomfix[7];                               //Меньше шансов чтобы вопросы повторялись
    int nature = 50;                                //Состояние окружения, природы, меняется в зависимости от выбора
    int social = 50;                                //Как относиться к вам народ
    int armament = 50;                              //Вооружение вашей страны
    int money = 50;                                 //Финансовое положение вашей страны
    int days = 0, years = 0;                        //Дни у власти
    int totalyears = 2075;                          //Какой сейчас год
    int k = 0;                                      //Временная переменная для спец. событий
    bool life = true;                               //Живы ли мы или нет
    days = (rand() % 30) + 7;
    {
    cout << "\t\t\t\t\t\tDictators\n\n";
    cout << "Добро пожаловать в Dictators." << endl;
    cout << "Введите ваше имя: ";
    cin >> name;
    system("cls");
    cout << "\n" << name << ", добро пожаловать в игру Dictators" << endl;
    //Game starts
    cout << "Ты готов начать миссию ?" << endl;
    yn();
    cin >> choose;
    clear();
    cout << "У тебя остались вопросы ?" << endl;
    yn();
    cin >> choose;
    clear();
    if (choose == 1)
    {
        cout << "Я так и знал, ты снова потерял память." << endl;
    }
    if (choose == 2)
    {
        cout << "Надо же, ты снова потерял память." << endl;
    }
    cout << "1. Где мы ?" << endl;
    cout << "2. Кто ты ?" << endl;
    cin >> choose;
    clear();
    if (choose == 1)
    {
        cout << "Мы находимся в мире, который принадлежит мне. А потому ты - мой гость." << endl;
        cout << "1. Кто я ?" << endl;
        cout << "2. Кто ты ?" << endl;
        cin >> choose;
        clear();
        if (choose == 1)
        {
            cout << "Это вопрос не ко мне. Единственное чем я могу помочь - попытаться вернуть тебе память." << endl;
        }
        else
        {
            cout << "Я - Время. К сожалению, я тороплюсь. Но могу освежить тебе память." << endl;
        }
        goto OsvejitiPamyati;
    }
    if (choose == 2)
    {
        cout << "Я - Время. К сожалению, я тороплюсь. Но могу освежить тебе память." << endl;
    }
OsvejitiPamyati:
    yn();
    cin >> choose;
    clear();
    if (choose == 1)
    {
    opisanie:
        cout << "Ты окажешься в 2075 году, где в результате многочисленных войн мир погружен в хаос." << endl;
        cout << "1. Продолжай" << endl;
        cout << "2. Достаточно" << endl;
        cin >> choose;
        clear();
        if (choose == 1)
        {
            cout << "Твоя задача - управлять одной из немногих стран, которые пока не пострадали от радиации и биологического оружия." << endl;
            cout << "1. Управлять ?" << endl;
            cout << "2. Радиации ?" << endl;
            cin >> choose;
            clear();
            cout << "Существо, которое говорило с вами, исчезает. Вы просыпаетесь в своем кабинете." << endl;
            choose = 1;
        }
        if (choose == 2)
        {
            cout << "Ладно - ладно, ты действительно справишься без подсказок ?" << endl;
            yn();
            cin >> choose;
            clear();
            if (choose == 1)
            {
                cout << "Существо, которое говорило с вами, исчезает. Вы просыпаетесь в своем кабинете." << endl;
            }
            else
            {
                goto opisanie;
            }
        }
    }
    if (choose == 2)
    {
        cout << "Ладно - ладно, ты действительно справишься без подсказок ?" << endl;
        yn();
        cin >> choose;
        clear();
        if (choose == 1)
        {
            cout << "Существо, которое говорило с вами, исчезает. Вы просыпаетесь в своем кабинете." << endl;
        }
        else
        {
            goto opisanie;
        }
    }
} //// Спрятали готовую часть
    cout << "\n\n\n\nПоддерживай равновесие между четырьмя показателями и, возможно, тебе удастся выжить..." << endl;
    cout << "\n\nЗагрузка игры..." << endl;
    Sleep(10000);                   //Уменьшаем время загрузки игры
    clear();
    while (nature > 1 && social > 1 && armament > 1 && money > 1)     //Если хоть один из показателей будет ниже единицы - игрок проиграл
    {
        if (nature > 100)
        {
            nature = 100;
        }
        if (social > 100)
        {
            social = 100;
        }
        if (armament > 100)
        {
            armament = 100;
        }
        if (money > 100)
        {
            money = 100;
        }
        cout << "Состояние окружающей среды: " << nature << endl;
        cout << "Социальное положение: " << social << endl;
        cout << "Вооружение: " << armament << endl;
        cout << "Финансовое положение: " << money << endl;
        cout << endl;
        if (days < 365)
        {
            cout << "Текущий год: " << totalyears << endl;
            cout << "У власти: " << days << " дней" << endl;
        }
        else
        {
            years = days / 365;
            days -= years * 365;
            totalyears += years;
            cout << "Текущий год: " << totalyears << endl;
            cout << "У власти: " << years;
            if (years > 1 && years < 5)
            {
                cout << " года, ";
            }
            if (years == 1)
            {
                cout << " год, ";
            }
            else
            {
                cout << " лет, ";
            }
            cout << days << " дней" << endl;
        }
        days += (rand() % 15) + 7;
        randomizeChallenge:
        random = (rand() % 35) + 1;
        {
            for (int i = 0; i < 7; i++)
            {
                if (random == randomfix[i])
                {
                    goto randomizeChallenge;
                }
            }
            randomfix[6] = randomfix[5];
            randomfix[5] = randomfix[4];
            randomfix[4] = randomfix[3];
            randomfix[3] = randomfix[2];
            randomfix[2] = randomfix[1];
            randomfix[1] = randomfix[0];
            randomfix[0] = random;
        }//Вопросы не будут повторяться
        cout << endl << endl << endl;
        switch (random)
        {
            case 1:
            {
                cout << "Министр здравоохранения С. Гибсон" << endl;
                cout << endl;
                cout << "Коровы начали производить молоко с примесью крови. Скоро эту новость подхватит пресса." << endl;
                cout << "1. Скройте от прессы" << endl;
                cout << "2. Неважно" << endl;
                cin >> choose;
                if (choose == 1)
                {
                    cout << "За денежное вознаграждение пресса согласилась не распостранять данную информацию. Но состояние окружающей среды ухудшилось" << endl;
                    money -= 5;
                    nature -= 5;
                    pause();
                }
                if (choose == 2)
                {
                    cout << "Люди узнали о данном инциденте, ваше социальное положение как предводителя значительно ухудшилось. Также ухудшилось и состояние окружающей среды." << endl;
                    nature -= 5;
                    social -= 10;
                    pause();
                }
                clear();
                break;
            }
            case 2:
            {
                cout << "Министр здравоохранения С. Гибсон" << endl;
                cout << endl;
                cout << "На юге страны процветает нелегальная торговля генетически модифицированными животными. Нужно это запретить" << endl;
                cout << "1. Да" << endl;
                cout << "2. Неважно" << endl;
                cin >> choose;
                if (choose == 1)
                {
                    cout << "Вам потребовалась поддержка военных, часть из них погибла или же была ранена.\nВ качестве компенсации вы выделили часть денег на лечение солдат. Также улучшилось состояние окружающей среды" << endl;
                    money -= 5;
                    nature += 5;
                    armament -= 5;
                    pause();
                }
                if (choose == 2)
                {
                    cout << "Люди узнали о данном инциденте, ваше социальное положение как правителя ухудшилось. Также ухудшилось и состояние окружающей среды." << endl;
                    nature -= 5;
                    social -= 5;
                    pause();
                }
                clear();
                break;
            }
            case 3:
            {
                cout << "Шеф-повар Марио" << endl;
                cout << endl;
                cout << "У меня нет опыта в политике, но в школе я был старостой класса.\nКак думаете, я смогу занять место генерала ?" << endl;
                cout << "1. Да" << endl;
                cout << "2. Нет" << endl;
                cin >> choose;
                if (choose == 1)
                {
                    cout << "Народ верит вам, Вы решились поставить на столь высокий пост обычного повара." << endl;
                    social += 5;
                    pause();
                }
                if (choose == 2)
                {
                    cout << "Вы не стали рисковать и ставит на данный пост \"кого-попало\".\nВскоре провелась военная реформа." << endl;
                    armament += 5;
                    pause();
                }
                clear();
                break;
            }
            case 4:
            {
                cout << "Губернатор Б. Армстронг" << endl;
                cout << endl;
                cout << "Часть населения голодает, у них нет денег даже на хлеб. Нужно снизить налоги, чтобы исправить ситуацию." << endl;
                cout << "1. Снизить налоги" << endl;
                cout << "2. Оставить налоги" << endl;
                cin >> choose;
                if (choose == 1)
                {
                    cout << "Люди признают в вас настоящего лидера. Но казна... Доход серьезно упал" << endl;
                    money -= 10;
                    social += 5;
                    pause();
                }
                if (choose == 2)
                {                    
                    cout << "Из за вас погибла часть населения. Люди недовольны!" << endl;
                    social -= 15;
                    pause();
                }
                clear();
                break;
            }
            case 5:
            {
                cout << "Шеф-повар Марио" << endl;
                cout << endl;
                cout << "Начальник охраны совсем спятил! Он конфисковал у меня ножи." << endl;
                cout << "1. Я поговорю с ним" << endl;
                cout << "2. Так безопоснее" << endl;
                cin >> choose;
                if (choose == 1)
                {
                    cout << "Повар рассказал о вашем поступке народу." << endl;
                    social += 5;
                    armament -= 5;
                    pause();
                }
                if (choose == 2)
                {
                    cout << "Начальник охраны прав. Так безопаснее." << endl;
                    armament += 5;
                    social -= 5;
                    pause();
                }
                clear();
                break;
            }
            case 6:
            {
                cout << "Научный сотрудник Б. Торрес" << endl;
                cout << endl;
                cout << "Наши технологии устарели. Нужно инвестировать в исследования." << endl;
                cout << "1. Хорошо" << endl;
                cout << "2. Не сейчас" << endl;
                cin >> choose;
                if (choose == 1)
                {
                    cout << "Благодаря вашим инвестициям военные получили новое снаряжение. Также удалось облагородить окружающую среду." << endl;
                    money -= 5;
                    nature += 5;
                    armament += 5;
                    pause();
                }
                if (choose == 2)
                {
                    cout << "Вы решили не инвестировать деньги в непонятно что. Последствия могут быть непредсказуемы. " << endl;
                    money += 5;
                    pause();
                }
                clear();
                break;
            }
            case 7:
            {
                cout << "Глава разведки Т. Мур" << endl;
                cout << endl;
                cout << "По некоторым данным, на севере страны увидели пришельца.\nСвидетелей много. Но скорее всего, это шутка" << endl;
                cout << "1. Расследуйте" << endl;
                cout << "2. Это шутка" << endl;
                cin >> choose;
                if (choose == 1)
                {
                    cout << "Деньги и военные силы были использованы зря. Ну хоть люди теперь спят спокойно." << endl;
                    armament -= 5;
                    money -= 10;
                    social += 10;
                    pause();
                }
                if (choose == 2)
                {
                    cout << "Вы не верите народу. Народ не верит вам." << endl;
                    social -= 10;
                    pause();
                }
                clear();
                break;
            }
            case 8:
            {
                cout << "Губернатор Б. Армстронг" << endl;
                cout << endl;
                cout << "Старый саркофаг ядерного реактора разваливается по частям.\nУтечка радиации может произойти в любой момент." << endl;
                cout << "1. Отремонтировать" << endl;
                cout << "2. Не сейчас" << endl;
                cin >> choose;
                if (choose == 1)
                {
                    cout << "Вы успели предотвратить катасрофу, хоть на это и ушло много денежных средств." << endl;
                    money -= 15;
                    nature += 5;
                    pause();
                }
                if (choose == 2)
                {
                    cout << "Вы пренебрегли безопастностью. В итоге пострадали люди.\nТакже вы способствовали загрязнению природы." << endl;
                    nature -= 15;
                    social -= 5;
                    pause();
                }
                clear();
                break;
            }
            case 9:
            {
                cout << "Шеф-повар Марио" << endl;
                cout << endl;
                cout << "Люди лучше соображают, когда они сыты. Предлагаю накрывать стол перед каждым приемом.\nЯ позабочусь об этом." << endl;
                cout << "1. Да" << endl;
                cout << "2. Нет" << endl;
                cin >> choose;
                if (choose == 1)
                {
                    cout << "Вы выделили часть денег повару на осуществление его идеи. Иностранные послы стали сговорчивей." << endl;
                    money -= 5;
                    social += 5;
                    pause();
                }
                if (choose == 2)
                {
                    cout << "Вы решили что сейчас не время разбрасываться деньгами." << endl;
                    pause();
                }
                clear();
                break;
            }
            case 10:
            {
                if (k > 0)
                {
                    continue;
                }
                cout << "Горничная Анна" << endl;
                cout << endl;
                cout << "Похоже, министр здравоохранения и генерал - больше, чем друзья.\nЯ часто вижу их вместе" << endl;
                cout << "1. Я тоже это заметил" << endl;
                cout << "2. Странно, я такого не замечал" << endl;
                cin >> choose;
                k++;
                clear();
                break;
            }
            case 11:
            {
                cout << "Научный сотрудник Б. Торрес" << endl;
                cout << endl;
                cout << "Исследования на бобовых культурах не принесло результата, и его закрыли.\nЧто делать с остатками продуктов ?" << endl;
                cout << "1. Раздать бедным" << endl;
                cout << "2. Продать" << endl;
                cin >> choose;
                if (choose == 1)
                {
                    cout << "За то что вы раздали бедным остаток продуктов, они вызвались почистить поля." << endl;
                    social += 5;
                    nature += 5;
                    pause();
                }
                if (choose == 2)
                {
                    cout << "Бедные расчитовали что они получат остаток продуктов, но вы его продали, тем самым разочаровав их." << endl;
                    money+=10;
                    social -= 5;
                    pause();
                }
                clear();
                break;
            }
            case 12:
            {
                cout << "Губернатор Б. Армстронг" << endl;
                cout << endl;
                cout << "На улицах южных городов больше десяти тысяч бездомных.\nНужно о них позаботиться: скоро наступит зима." << endl;
                cout << "1. Да" << endl;
                cout << "2. Нет" << endl;
                cin >> choose;
                if (choose == 1)
                {
                    cout << "Еще одно доброе дело в вашу копилку." << endl;
                    pause();
                }
                if (choose == 2)
                {
                    cout << "Большенство бездомных умерли на улицах как собаки." << endl;
                    social -= 10;
                    money += 5;
                    pause();
                }
                clear();
                break;
            }
            case 13:
            {
                cout << "Генерал М. Брукс" << endl;
                cout << endl;
                cout << "Наша армия может оказаться неэффективной в случае войны. Создадим ядерное оружие!" << endl;
                cout << "1. Да" << endl;
                cout << "2. Нет" << endl;
                cin >> choose;
                if (choose == 1)
                {
                    cout << "Все поменялось. Но не все в лучшую сторону..." << endl;
                    money -= 5;
                    nature -= 15;
                    armament += 20;
                    social -= 5;
                    pause();
                }
                if (choose == 2)
                {
                    cout << "Не стоит рисковать. Это же ЯДЕРНОЕ ОРУЖИЕ." << endl;
                    armament -= 5;
                    social += 5;
                    pause();
                }
                clear();
                break;
            }
            case 14:
            {
                cout << "Министр здравоохранения С. Гибсон" << endl;
                cout << endl;
                cout << "Один из городов поразила эпидемия неизвестного вируса.\nВрачи говорят, что он может быть смертельным." << endl;
                cout << "1. Изолируйте город" << endl;
                cout << "2. Лечите людей" << endl;
                cin >> choose;
                if (choose == 1)
                {
                    cout << "Зараженные попросто умерли, так как не имели надлежащего лекарства. Город опустел, вымер..." << endl;
                    social -= 20;
                    nature -= 5;
                    pause();
                }
                if (choose == 2)
                {
                    cout << "Жители рады. Вы не бросили их в трудную минуту." << endl;
                    money -= 10;
                    social += 5;
                    pause();
                }
                clear();
                break;
            }
            case 15:
            {
                cout << "Министр экономики А. Дуган" << endl;
                cout << endl;
                cout << "Закон запрещает гражданам торговать без разрешения.\nЕсли убрать это ограничение, в бюджет поступит больше денег." << endl;
                cout << "1. Убрать" << endl;
                cout << "2. Ничего не менять" << endl;
                cin >> choose;
                if (choose == 1)
                {
                    cout << "Нам нужны деньги. Военные насторожились.\nСуществование данного закона давало им право штрафовать нелегалов." << endl;
                    money += 5;
                    armament -= 5;
                    pause();
                }
                if (choose == 2)
                {
                    cout << "Военные продолжают наживаться за счет закона. Тем временем финансовое положение страны еще больше слабеет." << endl;
                    money -= 5;
                    armament += 5;
                    pause();
                }
                clear();
                break;
            }
            case 16:
            {
                cout << "Генерал М. Брукс" << endl;
                cout << endl;
                cout << "В пригородах столицы стало опасно. Нужно увеличить количество патрулей." << endl;
                cout << "1. Да" << endl;
                cout << "2. Нет" << endl;
                cin >> choose;
                if (choose == 1)
                {
                    cout << "Благодаря своевременному увеличению количества патрулей удалось предотвратить случаи ограбления." << endl;
                    money -= 10;
                    armament += 10;
                    social += 5;
                    pause();
                }
                if (choose == 2)
                {
                    cout << "На днях было совершено ограбление Национального банка. Охрана и заложники были убиты, деньги украдены." << endl;
                    social -= 15;
                    armament -= 5;
                    money -= 5;
                    pause();
                }
                clear();
                break;
            }
            case 17:
            {
                cout << "Губернатор Б. Армстронг" << endl;
                cout << endl;
                cout << "Охраняемость города значительно улучшилось. Жители спят спокойно." << endl;
                cout << "1. Да" << endl;
                cout << "2. Нет" << endl;
                cin >> choose;
                if (choose == 1)
                {
                    cout << "" << endl;
                    money -= 5;
                    social += 5;
                    armament += 5;
                    pause();
                }
                if (choose == 2)
                {
                    cout << "На днях было совершенно убийство. Улики не найдены." << endl;
                    social -= 10;
                    pause();
                }
                clear();
                break;
            }
            case 18:
            {
                cout << "Генерал М. Брукс" << endl;
                cout << endl;
                cout << "На севере произошел побег из тюрьмы.\nПреступники очень опасны, их нужно задержать." << endl;
                cout << "1. Да" << endl;
                cout << "2. Нет" << endl;
                cin >> choose;
                if (choose == 1)
                {
                    cout << "Вооруженные силы нагнали преступников, но так как те оказались вооружены, пришлось стрелять на поражение.\nЕсть потери." << endl;
                    armament -= 5;
                    social += 5;
                    pause();
                }
                if (choose == 2)
                {
                    cout << "Утренние новости: На севере странны очередное убийство...\nПолиция предполагает что убийство было совершено недавно сбежавшими преступниками." << endl;
                    social -= 10;
                    pause();
                }
                clear();
                break;
            }
            case 19:
            {
                cout << "Губернатор Б. Армстронг" << endl;
                cout << endl;
                cout << "В южных городах участились кражи. Пострадавшие требуют компенсации от государства." << endl;
                cout << "1. Компенсировать" << endl;
                cout << "2. Еще чего!" << endl;
                cin >> choose;
                if (choose == 1)
                {
                    cout << "Народ устраивает забастовки. Они больше не чувствуют себя в безопастности.\nСегодня их кошелек. Завтра их жизнь." << endl;
                    money += 5;
                    social -= 10;
                    pause();
                }
                if (choose == 2)
                {
                    cout << "Народ благодарен. Он искренне надеется что в скором времени будут найдены и воры." << endl;
                    money -= 5;
                    social += 10;
                    pause();
                }
                clear();
                break;
            }
            case 20:
            {
                cout << "Министр здравоохранения С. Гибсон" << endl;
                cout << endl;
                cout << "Большинство людей по-прежнему живут в нищете. Это необходимо исправить." << endl;
                cout << "1. Да" << endl;
                cout << "2. Нет" << endl;
                cin >> choose;
                if (choose == 1)
                {
                    cout << "Люди недовольны. В знак протеста они сжигают ранее обрабатываемые поля." << endl;
                    social -= 10;
                    nature -= 5;
                    pause();
                }
                if (choose == 2)
                {
                    cout << "Генерал не понял ваш поступок, в бюджете и так мало денег." << endl;
                    nature += 5;
                    social += 10;
                    armament -= 5;
                    money -= 5;
                    pause();
                }
                clear();
                break;
            }
            case 21:
            {
                cout << "Вице-президент Д. Орвилл" << endl;
                cout << endl;
                cout << "Мы нашли крупное месторождение нефти." << endl;
                cout << "1. Мы богаты!" << endl;
                cout << "2. Я богат!" << endl;
                cin >> choose;
                if (choose == 1)
                {
                    cout << "Все улучшилось. И, как ни странно, все к лучшему !" << endl;
                    money += 5;
                    nature += 5;
                    social += 5;
                    armament += 5;
                    pause();
                }
                if (choose == 2)
                {
                    cout << "Всю прибыль от продажи \"черного золота\" вы оставили себе." << endl;
                    money += 15;
                    pause();
                }
                clear();
                break;
            }
            case 22:
            {
                cout << "Научный сотрудник Б. Торрес" << endl;
                cout << endl;
                cout << "Новый пестицид существенно повышает сборы урожая. Куда направить прибыль ?" << endl;
                cout << "1. На исследования" << endl;
                cout << "2. В казну" << endl;
                cin >> choose;
                if (choose == 1)
                {
                    cout << "Деньги были направленны на развитие бобовых культур. Люди довольны. Военные получили новое обмундирование." << endl;
                    armament += 5;
                    nature += 5;
                    social += 5;
                    pause();
                }
                if (choose == 2)
                {
                    cout << "Новые купюры казне не помешают." << endl;
                    money += 10;
                    pause();
                }
                clear();
                break;
            }
            case 23:
            {
                cout << "Генерал М. Брукс" << endl;
                cout << endl;
                cout << "Армия ослабла, а люди стали ленивыми. Вернем воинскую повинность!" << endl;
                cout << "1. Да" << endl;
                cout << "2. Нет" << endl;
                cin >> choose;
                if (choose == 1)
                {
                    cout << "Люди стали побаиваться военных" << endl;
                    social -= 10;
                    armament += 5;
                    pause();
                }
                if (choose == 2)
                {
                    cout << "Никакой воинской повинности в нашем государстве не будет!" << endl;
                    armament -= 5;
                    social += 5;
                    pause();
                }
                clear();
                break;
            }
            case 24:
            {
                cout << "Генерал М. Брукс" << endl;
                cout << endl;
                cout << "У нас маленькая и слабая армия. Нам нужны новобранцы." << endl;
                cout << "1. Да" << endl;
                cout << "2. Нет" << endl;
                cin >> choose;
                if (choose == 1)
                {
                    cout << "Никто не будет служить за бесплатно" << endl;
                    money -= 10;
                    armament += 10;
                    pause();
                }
                if (choose == 2)
                {
                    cout << "Генерал ушел недовольным. Он несогласен с вашим мнением." << endl;
                    armament -= 5;
                    social += 5;
                    pause();
                }
                clear();
                break;
            }
            case 25:
            {
                cout << "Научный сотрудник Б. Торрес" << endl;
                cout << endl;
                cout << "Неудачный эксперимент в одной из лабораторий высвободил тысячи генетически модифицированных комаров." << endl;
                cout << "1. Это опасно ?" << endl;
                cout << "2. Мне все равно" << endl;
                cin >> choose;
                if (choose == 1)
                {
                    cout << "У этих комаров нет хищников. Если ничего не придумать. у нас будут неприятности.\nКому поручить это дело ?" << endl;
                    cout << "1. Армии" << endl;
                    cout << "2. Ученным" << endl;
                    cin >> choose;
                    if (choose == 1)
                    {
                        cout << "Армия оказалась бессильна против коимаров. Пострадали люди." << endl;
                        social -= 5;
                        armament -= 10;
                        pause();
                    }
                    if (choose == 2)
                    {
                        cout << "Благодаря научным исследованиям удалось предотвратить беду." << endl;
                        social += 5;
                        money -= 10;
                        pause();
                    }
                }
                if (choose == 2)
                {
                    cout << "Оказалось что данные комары стали переносчиками страшной инфекции. Есть пострадавшие." << endl;
                    social -= 5;
                    pause();
                }
                clear();
                break;
            }
            case 26:
            {
                cout << "Научный сотрудник Б. Торрес" << endl;
                cout << endl;
                cout << "Испытания ядерного оружия могли бы существенно продвинуть науку вперед." << endl;
                cout << "1. Верно" << endl;
                cout << "2. Это опасно" << endl;
                cin >> choose;
                if (choose == 1)
                {
                    cout << "Бдагодаря испытаниям, ваши ученные создали новый вид ядерной бомбы, который позже был продан соседнему государству.\nНо есть и плохая новость. Во время испытаний реактивный мусор был выброшен в реки, из-за чего часть людей пострадала." << endl;
                    money += 15;
                    nature -= 15;
                    social -= 5;
                    pause();
                }
                if (choose == 2)
                {
                    cout << "Народ не хочет стать случайной жертвой ядерного взрыва." << endl;
                    nature += 5;
                    social += 5;
                    money += 5;
                    pause();
                }
                clear();
                break;
            }
            case 27:
            {
                cout << "Садовник М. Грин" << endl;
                cout << endl;
                cout << "Растения необходимы для здоровья людей. Нужно строить больше парков и зеленых зон." << endl;
                cout << "1. Хорошо" << endl;
                cout << "2. Нет необходимости" << endl;
                cin >> choose;
                if (choose == 1)
                {
                    cout << "Теперь людям есть где провести свободное время." << endl;
                    money -= 10;
                    nature += 5;
                    social += 5;
                    pause();
                }
                if (choose == 2)
                {
                    cout << "Люди видят жизнь в серых тонах..." << endl;
                    money += 5;
                    social -= 10;
                    pause();
                }
                clear();
                break;
            }
            case 28:
            {
                cout << "Первая леди Алиша Холл" << endl;
                cout << endl;
                cout << "Скоро состоится открытие художественной выставки. Ты мог бы выступить с речью" << endl;
                cout << "1. Да" << endl;
                cout << "2. Нет" << endl;
                cin >> choose;
                if (choose == 1)
                {
                    cout << "Вы хорошо выступили перед народом." << endl;
                    money -= 5;
                    social += 5;
                    pause();
                }
                if (choose == 2)
                {
                    cout << "Вы решили не тратить время попусту. Генерал вас поддержал." << endl;
                    armament += 5;
                    social -= 5;
                    pause();
                }
                clear();
                break;
            }
            case 29:
            {
                cout << "Генерал М. Брукс" << endl;
                cout << endl;
                cout << "Война с южными странами принесла много пленников." << endl;
                cout << "1. Не трогайте их" << endl;
                cout << "2. Допросите их" << endl;
                cin >> choose;
                if (choose == 1)
                {
                    cout << "Вы понимаете что генерал может прибегнуть к пыткам. Вам стало жалко пленных." << endl;
                    armament -= 5;
                    social += 5;
                    pause();
                }
                if (choose == 2)
                {
                    cout << "Народу жалко пленных. Ведь пленные тоже люди. Они считают вас бессердечным." << endl;
                    armament += 10;
                    social -= 10;
                    pause();
                }
                clear();
                break;
            }
            case 30:
            {
                cout << "Глава разведки Т. Мур" << endl;
                cout << endl;
                cout << "Одна преступная организация захватывает контроль в небольших городах на юге." << endl;
                cout << "1. Нужно вмешаться" << endl;
                cout << "2. Неважно" << endl;
                cin >> choose;
                if (choose == 1)
                {
                    cout << "<Благодаря вмешательству военных вы ликвидировали преступную организацию." << endl;
                    money -= 5;
                    social += 5;
                    armament -= 10;
                    pause();
                }
                if (choose == 2)
                {
                    cout << "Вы потеряли влияние в трех южных городах. Было Основано новое государство." << endl;
                    money -= 10;
                    social -= 15;
                    pause();
                }
                clear();
                break;
            }
            case 31:
            {
                cout << "Губернатор Б. Армстронг" << endl;
                cout << endl;
                cout << "В пригородных районах появилось много диких собак. Они собираются в стаи и нападают на людей.\nНужно принять меры." << endl;
                cout << "1. Да" << endl;
                cout << "2. Нет" << endl;
                cin >> choose;
                if (choose == 1)
                {
                    cout << "Военные выловили всех собак. Теперь их место в приюте. Люди считают что это правильное решение." << endl;
                    money -= 5;
                    social += 5;
                    pause();
                }
                if (choose == 2)
                {
                    cout << "На днях собаки загрызли человека. Людям страшно выходить на улицу." << endl;
                    nature -= 5;
                    social -= 5;
                    money += 5;
                    pause();
                }
                clear();
                break;
            }
            case 32:
            {
                cout << "Губернатор Б. Армстронг" << endl;
                cout << endl;
                cout << "Люди огорчены недавними решениями правительства в военной сфере.\nОни говорят об интригах, коррупции и войне." << endl;
                cout << "1. Пересмотрим решения" << endl;
                cout << "2. Пусть болтают" << endl;
                cin >> choose;
                if (choose == 1)
                {
                    cout << "Вы провели ряд реформ. Виновные наказаны. Справедливость восторжествовала." << endl;
                    armament -= 5;
                    money -= 5;
                    social += 5;
                    pause();
                }
                if (choose == 2)
                {
                    cout << "Кому какое дело до мнения народа." << endl;
                    armament += 5;
                    social -= 10;
                    pause();
                }
                clear();
                break;
            }
            case 33:
            {
                cout << "Шеф-повар Марио" << endl;
                cout << endl;
                cout << "У нас очень скромная коллекция вин. Предлагаю это исправить.\nГенерал давно просил о чем-то новеньком." << endl;
                cout << "1. Да" << endl;
                cout << "2. Нет" << endl;
                cin >> choose;
                if (choose == 1)
                {
                    cout << "Как вы относитесь к генералу, так и армия к вам." << endl;
                    armament += 5;
                    money -= 5;
                    pause();
                }
                if (choose == 2)
                {
                    cout << "У нас достаточно богатая коллекция вин." << endl;
                    pause();
                }
                clear();
                break;
            }
            case 34:
            {
                cout << "Губернатор Б. Армстронг" << endl;
                cout << endl;
                cout << "Некоторые законы устарели. Нужно их пересмотреть." << endl;
                cout << "1. Ладно" << endl;
                cout << "2. Нет необходимости" << endl;
                cin >> choose;
                if (choose == 1)
                {
                    cout << "Вы решили повысить рабочим зарплаты." << endl;
                    money -= 5;
                    social += 5;
                    pause();
                }
                if (choose == 2)
                {
                    cout << "\"Стране нужны реформы\" - кричат люди." << endl;
                    money += 5;
                    social -= 5;
                    pause();
                }
                clear();
                break;
            }
            case 35:
            {
                cout << "Посол Т. Росс" << endl;
                cout << endl;
                cout << "В некоторых регионах слишком много военных баз.\nСолдаты проводят время без дела и проедают бюджетные деньги." << endl;
                cout << "1. Сократить расходы" << endl;
                cout << "2. Оставить как есть" << endl;
                cin >> choose;
                if (choose == 1)
                {
                    cout << "Часть военных попали под сокращение. Удастся сократить хоть немного расходы." << endl;
                    armament -= 10;
                    money += 5;
                    pause();
                }
                if (choose == 2)
                {
                    cout << "Народ возмущен. Почему надо так много платить за свою безопасность." << endl;
                    armament += 5;
                    social -= 5;
                    pause();
                }
                clear();
                break;
            }
        }
    }
    cout << "Вы проиграли...";
}
